src/Catalogs/Карты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Карты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийКодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаБлокировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаУдалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКартыОктаграм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУстановок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьБиометрию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаУстановкуКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыВнешнихСистем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Calltouch</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Chat2Desk</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CoMagic</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GreenApi</Name>
					<Comment>WhatsApp</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>JivoSite</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Marquiz</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Roistat</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TapLink</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Telegram</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Tilda</Name>
					<Comment>Ловец лидов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Viber</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Vkontakte</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VkontakteApi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Webhook</Name>
					<Comment>Получение лидов стандартный набор параметров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВиджетОнлайнЗаписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИЭМК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтурСтрахование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложениеУправляющего</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОценкиИОтзывы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроДокторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексМетрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаБыстрыхПлатежей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Штриховая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Магнитная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wallet</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяСеть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МобильноеПриложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КороткийАдрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Координаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯндексОтзывы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходящееПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Письмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПушУведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мессенджер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/РассылкаСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РассылкаСообщений</Name>
			<Comment>Рассылка сообщений</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Comment>Автор документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОперацииОтправкаSMS</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Comment>Дата отправки сообщений</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьНемедленно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Comment>Содержание сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеUTF8</Name>
					<Comment>Содержание сообщения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисSMSРассылки</Name>
					<Comment>Сервис SMS-Рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистемаМессенджера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
					<Comment>Получатели сообщений</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Comment>Ключ строки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Comment>Номер телефон получателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Comment>Получатель сообщения</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдКанала</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СервисРассылки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
								<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/Карты/Forms/ФормаНовогоЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПредВидКарты;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере" ФормыЭлемента
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Параметры.Свойство("ВладелецКарты", Объект.ВладелецКарты);
	Параметры.Свойство("ВидКарты"	  , Объект.ВидКарты);
	Параметры.Свойство("ТипКода"	  , Объект.ТипКода);
		
	Элементы.ВладелецКарты.Видимость = Не ЗначениеЗаполнено(Объект.ВладелецКарты);
	
	Объект.ДатаОткрытия = ТекущаяДата();
		
	НовыйЭлемент = Истина;
	
	ВнешняяСистемаWallet = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Wallet);	
	ВСНастроена 		 = Константы.ИспользоватьWallet.Получить() И ЗначениеЗаполнено(ВнешняяСистемаWallet.КлючШифрования) И ЗначениеЗаполнено(ВнешняяСистемаWallet.ТокенДоступа);
		
	ИспользуемыйВидКарт = Константы.ИспользуемыйВидКарт.Получить();
	
	Если Не ЗначениеЗаполнено(Объект.ТипКода) Тогда
		Объект.ТипКода = ?(ИспользуемыйВидКарт = Перечисления.ВидыКарт.Wallet И ВСНастроена, ИспользуемыйВидКарт, Перечисления.ВидыКарт.Штриховая);	
	КонецЕсли;
	
	ЭтотОбъект.ТекущаяСтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	ЭтотОбъект.ВидКартыWalletПоУмолчанию = Константы.ВидКартыWalletПоУмолчанию.Получить(); 

	Если Объект.ТипКода = Перечисления.ВидыКарт.Wallet
		И Не ЗначениеЗаполнено(Объект.ВидКарты) Тогда
		Объект.ВидКарты = ЭтотОбъект.ВидКартыWalletПоУмолчанию;		
	КонецЕсли;
	
	ЗаполнитьСервисыРассылки();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	Объект.Наименование = СформироватьАвтоНаименование();
	
	//ПодключитьОбработчикОжидания("УстановитьВидимостьДоступность", 0.001, Истина);
	
	ПредВидКарты = Объект.ВидКарты;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события формы "ПриЗакрытии".
//
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	//УстановитьФлагБиометрииГантнер(Ложь);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик оповещения формы.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ВнешнееОборудование
	Если Источник = "ВнешнееОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда
			
			// Преобразуем предварительно к ожидаемому формату.
			Данные = Новый Массив();
			Если Параметр[1] = Неопределено Тогда
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[0], 1)); // Достаем штрихкод из основных данных.
			Иначе
				Данные.Добавить(Новый Структура("Штрихкод, Количество", Параметр[1][1], 1)); // Достаем штрихкод из дополнительных данных.
			КонецЕсли;
			
			ПолученыШтрихкоды(Данные, ИмяСобытия);
			
		ИначеЕсли ИмяСобытия = "TracksData" Тогда
			
			ДанныеКарты     = МенеджерОборудованияКлиент.ОбработатьДанныеМагнитнойКарты(Параметр);
			Объект.КодКарты = ДанныеКарты.КодШифра;
			Объект.ТипКода  = ПредопределенноеЗначение("Перечисление.ВидыКарт.Магнитная");
						
		КонецЕсли;
		
		УстановитьВидимостьДоступность();
		
	КонецЕсли;
	
	Если ИмяСобытия = "СОХРАНЕНИЕ_ВНЕШНЕЙ_СИСТЕМЫ" Тогда
		
		ВСНастроена = ВСWalletНастроена();
		
		УстановитьВидимостьДоступность();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере" ЭлементаФормы
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	Если НЕ Константы.ИспользуемыйВидКарт.Получить() = Объект.ТипКода Тогда
		
		Константы.ИспользуемыйВидКарт.Установить(Объект.ТипКода);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события формы "ПослеЗаписи".
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("СозданаНоваяКарта"); 
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "СгенерироватьКодКарты".
//
Процедура СгенерироватьКодКарты(Команда)
	
	Объект.КодКарты = СформироватьШтрихкодEAN13();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьКарту".
//
Процедура СоздатьКарту(Команда)
	
	Если Не (Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet") 
		Или ЗначениеЗаполнено(Объект.КодКарты)) Тогда
		
		ПоказатьОповещениеПользователя("Карта (создание)",, СтрШаблон("Поле ""%1"" не заполнено", ?(Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Штриховая"), "Штрихкод", "Заводской номер карты")), БиблиотекаКартинок.Предупреждение32, СтатусОповещенияПользователя.Важное);		
		Возврат;
		
	КонецЕсли;
	
	Если ЭтаФорма.Записать() Тогда
		
		ЭтаФорма.Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура, обработчик события "ДекорацияЭлектроннаяКартаНажатие".
//
Процедура ДекорацияЭлектроннаяКартаНажатие(Элемент)
	
	Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet");	
	
	Объект.Наименование = СформироватьАвтоНаименование();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ДекорацияМагнитнаяКартаНажатие".
//
Процедура ДекорацияМагнитнаяКартаНажатие(Элемент)
	
	Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Магнитная");
	Если Объект.Ссылка.Пустая() Тогда
		Объект.КодКарты = "";
	КонецЕсли;
	
	Объект.Наименование = СформироватьАвтоНаименование();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ДекорацияШтриховаяКартаНажатие".
//
Процедура ДекорацияШтриховаяКартаНажатие(Элемент)
	
	Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Штриховая");
	Если Объект.Ссылка.Пустая() Тогда
		Объект.КодКарты = "";
	КонецЕсли;

	Объект.Наименование = СформироватьАвтоНаименование();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "КартаКодКартыПриИзменении".
//
Процедура КартаКодКартыПриИзменении(Элемент)
	
	Объект.Наименование = СформироватьАвтоНаименование();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "КартаВидКартыСоздание".
//
Процедура КартаВидКартыСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура();
	
	Если Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet") Тогда
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("ТипКода", Объект.ТипКода));
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ВидыКарт.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
// Сформировать штрихкод формата EAN13
//
Функция СформироватьШтрихкодEAN13()
	
	Возврат РегистрыСведений.Штрихкоды.СформироватьШтрихкодEAN13();
	
КонецФункции 

&НаКлиенте
// Процедура, обрабатывает изменение типа кода карты.
//
Процедура УстановитьВидимостьДоступность()
	
	УстановитьТекущийВидКарты();
	
	ЭлектроннаяКарта = Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet");
	ШтриховаяКарта   = Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Штриховая");
	МагнитнаяКарта   = Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Магнитная");
	
	Если ЭлектроннаяКарта Тогда
		
		ПредВидКарты    = Объект.ВидКарты;
		Объект.ВидКарты = ЭтотОбъект.ВидКартыWalletПоУмолчанию;
		
	Иначе 
		
		Объект.ВидКарты = ПредВидКарты;
		
	Конецесли;
	
	Элементы.ВладелецКарты.ОграничениеТипа = Новый ОписаниеТипов(Новый_Массив(Тип("СправочникСсылка.Контрагенты"), Тип("СправочникСсылка.Сотрудники")));
	
	Элементы.ГруппаЭлектроннаяКарта.Видимость  = ВСНастроена;
	
	Элементы.КартаКодКарты.Видимость    	   = Не ЭлектроннаяКарта;
	Элементы.КартаКодКарты.ПодсказкаВвода      = ?(ШтриховаяКарта, "Штрихкод", "Заводской номер карты");
	
	Элементы.КартаКодКарты.АвтоВыборНезаполненного = Не ЭлектроннаяКарта;
	
	Элементы.КартаВнутреннийКодКарты.Видимость = Не ЭлектроннаяКарта;
	
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.СгенерироватьКодКарты.Видимость = ШтриховаяКарта ИЛИ МагнитнаяКарта;
	Иначе
		Элементы.КартаКодКарты.МаксимальнаяШирина = 25;
	КонецЕсли;
		
	Элементы.ГруппаОтправить.Видимость = ЭлектроннаяКарта И ВСНастроена;
	Элементы.КартаВидКарты.Видимость   = Не ЭлектроннаяКарта Или ВСНастроена;
	
	Элементы.КартаДобавить.Доступность = Не ЭлектроннаяКарта Или ВСНастроена;
	
	МассивВидовКарт = ПолучитьМассивДоступныхВидовКарт(ЭлектроннаяКарта);
	
	Если МассивВидовКарт.Количество() > 0 Тогда 
		
		Элементы.КартаВидКарты.СписокВыбора.Очистить();
		Элементы.КартаВидКарты.СписокВыбора.ЗагрузитьЗначения(МассивВидовКарт);
		
	Иначе
		
		Элементы.КартаВидКарты.СписокВыбора.Очистить();
		Элементы.КартаВидКарты.СписокВыбора.Добавить(,"Не существует видов карт. Создайте вид карты.");
		
	КонецЕсли;
	
	Элементы.КартаВидКарты.КнопкаСоздания = Не ЭлектроннаяКарта Или ВСНастроена;
	
	УстановитьОтметкуНезаполненого(ЭлектроннаяКарта);
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает отметку незаполненого.
//
Процедура УстановитьОтметкуНезаполненого(ЭлектроннаяКарта)
		
	Если ЭлектроннаяКарта Тогда
		
		Элементы.КартаВидКарты.АвтоОтметкаНезаполненного = Истина;
		Элементы.ВладелецКарты.АвтоОтметкаНезаполненного = Истина;
		
	Иначе
		
		
		Элементы.КартаВидКарты.ОтметкаНезаполненного = Ложь;
		Элементы.ВладелецКарты.ОтметкаНезаполненного = Ложь;
		
		Элементы.КартаВидКарты.АвтоОтметкаНезаполненного = Неопределено;
		Элементы.ВладелецКарты.АвтоОтметкаНезаполненного = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает текущий вид карт.
//
Процедура УстановитьТекущийВидКарты()
	
	Элементы.ГруппаЭлектроннаяКарта.ЦветФона = Новый Цвет(255, 255, 255);
	Элементы.ГруппаМагнитнаяКарта.ЦветФона   = Новый Цвет(255, 255, 255);
	Элементы.ГруппаШтриховаяКарта.ЦветФона   = Новый Цвет(255, 255, 255);
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Wallet") Тогда	
			Элементы.ГруппаЭлектроннаяКарта.ЦветФона = Новый Цвет(195, 217, 246);	
		ИначеЕсли Объект.ТипКода = ПредопределенноеЗначение("Перечисление.ВидыКарт.Магнитная") Тогда
			Элементы.ГруппаМагнитнаяКарта.ЦветФона = Новый Цвет(195, 217, 246);
		Иначе
			Элементы.ГруппаШтриховаяКарта.ЦветФона = Новый Цвет(195, 217, 246);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, возвращает массив доступных видов карт.
//
Функция ПолучитьМассивДоступныхВидовКарт(ЭлектроннаяКарта)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыКарт.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыКарт КАК ВидыКарт
	|ГДЕ
	|	НЕ ВидыКарт.ПометкаУдаления
	|	И &УсловиеВидКарты");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &УсловиеВидКарты", ?(ЭлектроннаяКарта, "И ВидыКарт.ИдентификаторПроекта <> 0", "И ВидыКарт.ИдентификаторПроекта = 0"));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	       	
КонецФункции

&НаКлиенте
// Функция формирует наименование карты клиента
//
Функция СформироватьАвтоНаименование()
	 		
	СтрокаНаименования = "" +Объект.КодКарты + ", " + Объект.ВладелецКарты + " (" + Объект.ТипКода + ")";
			
	Возврат СтрокаНаименования;
	
КонецФункции 

&НаСервере
// Получить штрихкод 
//
Функция ПолученыШтрихкоды(ДанныеШтрикодов, ИмяСобытия)
	
	Модифицированность = Истина;
	
	Если ДанныеШтрикодов.Количество() > 0 Тогда
		Объект.ТипКода = Перечисления.ВидыКарт.Штриховая;
		Объект.КодКарты = ДанныеШтрикодов[ДанныеШтрикодов.Количество() - 1].Штрихкод;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции 

&НаСервереБезКонтекста
// Функция, возвращает внешнюю систему.
//
Функция ВСWalletНастроена()
	
	Если Не Константы.ИспользоватьWallet.Получить() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВС = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.Wallet);
	
	Возврат ЗначениеЗаполнено(ВС.КлючШифрования) И ЗначениеЗаполнено(ВС.ТокенДоступа); 
	
КонецФункции

&НаКлиенте
// Процедура - Удалить карту
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура УдалитьКарту(Команда)
	
	УдалитьКартуНаСервере();
	Оповестить("ИзмененаКарта");
	Закрыть();
	
КонецПроцедуры

&НаСервере
// Процедура - Удалить карту на сервере
//
Процедура УдалитьКартуНаСервере()
	
	ОбъектКарты = Объект.Ссылка.ПолучитьОбъект();	
	ОбъектКарты.УстановитьПометкуУдаления(Истина);
	
КонецПроцедуры	

&НаСервере
// Процедура, заполняет сервисы рассылки.
//
Процедура ЗаполнитьСервисыРассылки()
	
	Если ЗначениеЗаполнено(Объект.ВладелецКарты)
		И Объект.ТипКода = Перечисления.ВидыКарт.Wallet Тогда
		
		СервисРассылкиВыбран = Ложь;
		
		НомерТелефона 						 = ПолучитьКонтактныеДанныеКонтрагента("Телефон");
		РасширениеМессенджераПодключено		 = ОбщегоНазначенияСтоматология.ИспользуетсяРасширение("Мессенджер") = Истина;
		ДоступныеВнешниеСистемыМессенджера	 = Документы.РассылкаСообщений.ПолучитьДоступныеДляОтправкиВнешниеСистемыМессенджера(Объект.ВладелецКарты, ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
		
		РассылкаВМессенджерРазрешена = ЗначениеЗаполнено(ДоступныеВнешниеСистемыМессенджера) И РасширениеМессенджераПодключено = Истина;
		
		Если РассылкаВМессенджерРазрешена Тогда
			
			ЭтотОбъект.ОтправитьВМессенджер = Истина;
			СервисРассылкиВыбран 		    = Истина;	
			
		Иначе
			
			ЭтотОбъект.ОтправитьВМессенджер = Ложь;
						
		КонецЕсли;
		
		Элементы.ГруппаМессенджер.Видимость = РассылкаВМессенджерРазрешена;
		
		АдресЭП = ПолучитьКонтактныеДанныеКонтрагента("АдресЭлектроннойПочты");
		
		РассылкаНаПочтуРазрешена = ПроверитьВозможностьИспользованияEmailРассылки() И ЗначениеЗаполнено(АдресЭП);
		
		Если РассылкаНаПочтуРазрешена
			И Не СервисРассылкиВыбран Тогда	
			
			ЭтотОбъект.ОтправитьПоEmail = Истина;
			СервисРассылкиВыбран 	    = Истина;
			
		Иначе	
			
			ЭтотОбъект.ОтправитьПоEmail = Ложь;
			
		КонецЕсли;
		
		Элементы.ГруппаEmail.Видимость = РассылкаНаПочтуРазрешена;
				
		РассылкаНаТелефонРазрешена = ЗначениеЗаполнено(НомерТелефона); //И ПроверитьВозможностьИспользованияSMSРассылки();
		
		Если РассылкаНаТелефонРазрешена 
			И Не СервисРассылкиВыбран Тогда	
			
			ЭтотОбъект.ОтправитьПоSMS = Истина;
			СервисРассылкиВыбран 	  = Истина
			
		Иначе	
			
			ЭтотОбъект.ОтправитьПоSMS = Ложь;	
			
		КонецЕсли;
		
		Элементы.ГруппаSMS.Видимость = РассылкаНаТелефонРазрешена;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, возвращает номера телефонов контрагентов.
//
Функция ПолучитьКонтактныеДанныеКонтрагента(ТипКонтактнойИнформации)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	&ВыбираемоеПоле КАК Контакт
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка = &Контрагент
	|	И КонтактнаяИнформация.Тип = &ТипКонтактнойИнформации
	|	И НЕ КонтактнаяИнформация.НеУчаствоватьВРассылке");
	
	Запрос.УстановитьПараметр("Контрагент"				, Объект.ВладелецКарты);
	Запрос.УстановитьПараметр("ТипКонтактнойИнформации" , Перечисления.ТипыКонтактнойИнформации[ТипКонтактнойИнформации]);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВыбираемоеПоле", ?(ТипКонтактнойИнформации = "Телефон", "КонтактнаяИнформация.НомерТелефона", "КонтактнаяИнформация.Представление"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Контакт, Неопределено);
	
КонецФункции

// Функция, проверяет возможность использования eamil рассылки.
//
Функция ПроверитьВозможностьИспользованияEmailРассылки()
		
	УчетныеЗаписиСуществуют = Справочники.УчетныеЗаписиЭлектроннойПочты.СуществуютУчетныеЗаписиЭлектроннойПочтыОбщиеИЛичные(ПараметрыСеанса.ТекущийПользователь, Ложь, Истина, Истина);
	
	Возврат УчетныеЗаписиСуществуют;
	
КонецФункции

&НаКлиенте
// Процедура, заополняет сервисы рассылки.
//
Процедура ВладелецКартыПриИзменении(Элемент)
	
	ЗаполнитьСервисыРассылки();
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПослеЗаписиНаСервере".
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.ТипКода = Перечисления.ВидыКарт.Wallet Тогда
			
		Если ЭтотОбъект.ОтправитьВМессенджер Тогда 
			ОтправитьСсылкуНаУстановкуКартыНаСервере(Объект.ВладелецКарты, 	ЭтотОбъект.ТекущаяСтруктурнаяЕдиница, Объект.Ссылка, "Мессенджер");	
		КонецЕсли;
		
		Если ЭтотОбъект.ОтправитьПоSMS Тогда
			ОтправитьСсылкуНаУстановкуКартыНаСервере(Объект.ВладелецКарты, 	ЭтотОбъект.ТекущаяСтруктурнаяЕдиница, Объект.Ссылка, "SMS");
		КонецЕсли;
		
		Если ЭтотОбъект.ОтправитьПоEmail Тогда
			
			ШаблонСообщения	 = ?(ЗначениеЗаполнено(Объект.Ссылка.ВидКарты.ШаблонСообщения), Объект.Ссылка.ВидКарты.ШаблонСообщения, Справочники.ШаблоныСообщений.СозданиеКарты);
			Содержание = ПреобразоватьСодержаниеСПараметрамиВТекст(ШаблонСообщения, Объект.Ссылка, "Email");
			СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(Объект.ВладелецКарты, АдресЭП, "Создание карты", Содержание, ШаблонСообщения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура, отправляет ссылку на установку карты.
//
Процедура ОтправитьСсылкуНаУстановкуКартыНаСервере(Получатель, ТекущаяСтруктурнаяЕдиница, Карта, СервисРассылки)
	
	ОписаниеОшибки	 = "";	
	ШаблонСообщения	 = ?(ЗначениеЗаполнено(Карта.ВидКарты.ШаблонСообщения), Карта.ВидКарты.ШаблонСообщения, Справочники.ШаблоныСообщений.СозданиеКарты);
	Содержание		 = ПреобразоватьСодержаниеСПараметрамиВТекст(ШаблонСообщения, Карта, СервисРассылки);
	
	ПолучателиСообщения = Новый Массив();
	ПолучателиСообщения.Добавить(Новый Структура("Получатель", Получатель));
	
	ПараметрыРассылки = Новый Структура;
	ПараметрыРассылки.Вставить("Получатели"			, ПолучателиСообщения);
	ПараметрыРассылки.Вставить("Содержание"			, Содержание);
	ПараметрыРассылки.Вставить("ШаблонСообщения"	, ШаблонСообщения);
	ПараметрыРассылки.Вставить("СтруктурнаяЕдиница"	, ТекущаяСтруктурнаяЕдиница);
	
	Если СервисРассылки = "SMS" Тогда
		ПараметрыРассылки.Вставить("ОтправкаSMS", Истина);
	КонецЕсли;
	
	Если СервисРассылки = "Мессенджер" Тогда
		ПараметрыРассылки.Вставить("ОтправкаMessenger"	 , Истина);
		ПараметрыРассылки.Вставить("ИнициироватьОтправку", Истина);
	КонецЕсли;
		
	ПараметрыРассылки.Вставить("ОтправитьНемедленно", Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Документы.РассылкаСообщений.СоздатьДокументРассылкаСообщений(ПараметрыРассылки, ОписаниеОшибки);
	
КонецПроцедуры
 
&НаСервереБезКонтекста
// Функция - Преобразовать содержание с параметрами в текст
// 
Функция ПреобразоватьСодержаниеСПараметрамиВТекст(ШаблонСообщения, Карта, СервисРассылки)
	
	Если СервисРассылки = "SMS" Тогда
		Содержание = ШаблонСообщения.Содержание;
		
	ИначеЕсли СервисРассылки = "Email" Тогда
		Содержание = ШаблонСообщения.ТекстHTML;
		
	ИначеЕсли СервисРассылки = "Мессенджер" Тогда
		Содержание = ШаблонСообщения.СодержаниеМессенджер;
		
	КонецЕсли;

	Возврат Справочники.ШаблоныСообщений.ПреобразоватьСодержаниеСПараметрамиВТекст(Содержание,,,,, Карта); 
	
КонецФункции

// Процедура, создает и отправляет сообщения.
//
Процедура СоздатьДокументSMSPushРассылкаИОтправить(ТипСобытия, Содержание, ВнешняяСистемаМессенджера = Неопределено)
	
	СтруктураПолучателя = Новый Структура("Получатель, НомерТелефона, Карта", Объект.ВладелецКарты);
	СтруктураПолучателя.НомерТелефона = НомерТелефона;	
	
	МассивСтруктурПолучателей = Новый_Массив(СтруктураПолучателя);
	Документы.РассылкаСообщений.СоздатьДокументSMSPushРассылкаИОтправить(МассивСтруктурПолучателей, Содержание,, ТипСобытия, ВнешняяСистемаМессенджера);	
	
КонецПроцедуры

// Функция - Создать документ исходящее письмо отправить письмо на сервере.
//
// Параметры:
//  МассивСтруктурПолучателей	 - 	 -
//  Содержание					 - 	 -
//  Тема						 - 	 -
//  ОписаниеОшибки				 - 	 -
//
// Возвращаемое значение:
//   -
//
Функция СоздатьДокументИсходящееПисьмоОтправитьПисьмоНаСервере(Контакт, Адрес, Тема, Содержание, ШаблонСообщения)
	
	//МассивСтруктурПолучателей = Новый Массив;
	//МассивСтруктурПолучателей.Добавить(Новый Структура("Контакт, Адрес", Контакт, Адрес));
	
	МассивПолучателей = Новый массив;
	МассивПолучателей.Добавить(Контакт);
	
	МассивEmail = Новый Массив;
	МассивEmail.Добавить(Адрес);
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Дата"				, ТекущаяДатаСеанса());
	ДанныеЗаполнения.Вставить("Тема"				, Тема);
	ДанныеЗаполнения.Вставить("Тело"				, Содержание);
	ДанныеЗаполнения.Вставить("ТекстHTML"			, Содержание);
	ДанныеЗаполнения.Вставить("МассивПолучателей"	, МассивПолучателей);
	ДанныеЗаполнения.Вставить("МассивEmail"			, МассивEmail);
	ДанныеЗаполнения.Вставить("Тип"					, Перечисления.ТипыСобытий.ВходящееПисьмо); 
	ДанныеЗаполнения.Вставить("АвторДокумента"		, ПараметрыСеанса.ТекущийПользователь);
	ДанныеЗаполнения.Вставить("Ответственный"		, ПараметрыСеанса.ТекущийПользователь);
	ДанныеЗаполнения.Вставить("ТипТекста"			, Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	ДанныеЗаполнения.Вставить("ШаблонСообщения"		, ШаблонСообщения);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИсходящееЭлектронноеПисьмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
	ИсходящееЭлектронноеПисьмо.Заполнить(ДанныеЗаполнения);
	
	ОписаниеОшибки = "";
	Документы.ЭлектронноеПисьмоИсходящее.ВыполнитьОтправкуПисьма(ИсходящееЭлектронноеПисьмо, ОписаниеОшибки);
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		ЭтаФорма.Закрыть(Объект.Ссылка);  
КонецПроцедуры

#КонецОбласти
